chore: replace mermaid diagrams with d2
Signed-off-by: Khoirul <ahmusafir.khoirul@gmail.com>
